---
kind: property
id: P:Autodesk.Revit.UI.RibbonItem.Visible
source: html/03c0742a-15ba-d46d-8cd7-5c5a1fb63a6c.htm
---
# Autodesk.Revit.UI.RibbonItem.Visible Property

Gets or sets a value indicating whether the item is visible.

## Syntax (C#)
```csharp
public bool Visible { get; set; }
```

## Remarks
When the Visible property is set to false, the item won't be displayed on Ribbon.